successful deployment and output of newly added computed params

```
λ terraform apply -auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:


  # azurerm_managed_application.virtual_edges_eu_west[0] will be created
  + resource "azurerm_managed_application" "virtual_edges_eu_west" {
      + id                          = (known after apply)
      + kind                        = "MarketPlace"
      + location                    = "westeurope"
      + managed_resource_group_name = "sdwan_nva_managed_grp_eu_west_testa"
      + name                        = "sdwanClusterEuWestTesta"
      + outputs                     = (known after apply)
      + parameter_values            = (known after apply)
      + parameters                  = {
          + "activationKey1"   = "XXXX-XXXX-XXXX-XXXX"
          + "activationKey2"   = "YYYY-YYYY-YYYY-YYYY"
          + "asn"              = "64600"
          + "hubId"            = "/subscriptions/xxxxxxxx-75c5-4e54-8d9b-9af81e2fd11b/resourceGroups/vwan_westeurope/providers/Microsoft.Network/virtualHubs/hub_westeurope_1"
          + "ignoreCertErrors" = "false"
          + "location"         = "westeurope"
          + "nvaName"          = "sdwanClusterEuWestTesta"
          + "scaleUnit"        = "2"
          + "vco"              = "vco23-fra1.velocloud.net"
          + "version"          = "latest"
        }
      + resource_group_name         = "velocloud_sdwan_nva_grp_eu_west"

      + plan {
          + name      = "vmwaresdwaninvwan"
          + product   = "vmware_sdwan_in_vwan"
          + publisher = "velocloud"
          + version   = "4.3.0"
        }
    }

  # azurerm_marketplace_agreement.vmware_sdwan_eu_west will be created
  + resource "azurerm_marketplace_agreement" "vmware_sdwan_eu_west" {
      + id                  = (known after apply)
      + license_text_link   = (known after apply)
      + offer               = "vmware_sdwan_in_vwan"
      + plan                = "vmwaresdwaninvwan"
      + privacy_policy_link = (known after apply)
      + publisher           = "velocloud"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + azure_vwan_hub_eu_west_asn             = 65515
  + azure_vwan_hub_eu_west_ips             = [
      + "10.222.0.68",
      + "10.222.0.69",
    ]
azurerm_marketplace_agreement.vmware_sdwan_eu_west: Creating...
azurerm_marketplace_agreement.vmware_sdwan_eu_west: Creation complete after 8s [id=/subscriptions/xxxxxxxx-75c5-4e54-8d9b-9af81e2fd11b/providers/Microsoft.MarketplaceOrdering/agreements/velocloud/offers/vmware_sdwan_in_vwan/plans/vmwaresdwaninvwan]
azurerm_managed_application.virtual_edges_eu_west[0]: Creating...
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [10s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [20s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [30s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [40s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [50s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [1m0s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [1m10s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [1m20s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [1m30s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [1m40s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [1m50s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [2m0s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [2m10s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [2m20s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [2m30s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [2m40s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [2m50s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [3m0s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [3m10s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [3m20s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [3m30s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [3m40s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [3m50s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [4m0s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [4m10s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [4m20s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [4m30s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [4m40s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [4m50s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [5m0s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [5m10s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [5m20s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [5m30s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [5m40s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [5m50s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [6m0s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [6m10s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [6m20s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [6m30s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [6m40s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [6m50s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [7m0s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [7m10s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [7m20s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Still creating... [7m30s elapsed]
azurerm_managed_application.virtual_edges_eu_west[0]: Creation complete after 7m35s [id=/subscriptions/xxxxxxxx-75c5-4e54-8d9b-9af81e2fd11b/resourceGroups/velocloud_sdwan_nva_grp_eu_west/providers/Microsoft.Solutions/applications/sdwanClusterEuWestTesta]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

Outputs:

azure_vwan_hub_eu_west_asn = 65515
azure_vwan_hub_eu_west_ips = toset([
  "10.222.0.68",
  "10.222.0.69",
])
```